package by.epam.homework.unit02;

import java.text.SimpleDateFormat;
import java.util.Date;
import java.util.concurrent.TimeUnit;

import static java.lang.Math.*;

/**
 * Created by Vitali_Markusheusky on 3/26/2019.
 */
public class HomeWork {

    public static void main(String[] args){
        Task1(); Task2(); Task3(); Task4(); Task5();
        Task6(); Task7(); Task8(); Task9(); Task10();
        Task11(); Task12(); Task13(); Task14(); Task15();
        Task16(); Task17(); Task18(); Task19(); Task20();
        Task21(); Task22(); Task23(); Task24(); Task25();
        Task26(); Task27();Task28(); Task29(); Task30();
        Task31(); Task32(); Task33(); Task34(); Task35();
        Task36(); Task37(); Task37b(); Task38();

    }

    public static void Task1(){
        //1. Даны два действительных числа х и  у. Вычислить их сумму, разность, произведение и частное.
        System.out.println("1. Даны два действительных числа х и  у. Вычислить их сумму, разность, произведение и частное.");
        double x, y;
        double c;
        x=1;
        y=3;
        c=x+y;
        System.out.println(c);
        c=x-y;
        System.out.println(c);
        c=x*y;
        System.out.println(c);
        c=x/y;
        System.out.println(c);
    }

    public static void Task2(){
         //2. Найдите  значение функции: с = 3 + а.
        System.out.println("2. Найдите  значение функции: с = 3 + а.");
        double c, a;
        a=5;
        c = 3+ a;
        System.out.println(c);
    }
    public static void Task3(){
        //3. Найдите  значение функции: z = 2 * x + ( y – 2 ) * 5.
        System.out.println("3. Найдите  значение функции: z = 2 * x + ( y – 2 ) * 5. ");
        double z, x, y;
        x=5;
        y=7;
        z = 2 * x + ( y - 2 ) * 5;
        System.out.println(z);
    }

    public static void Task4(){
        //3. Найдите  значение функции: z = 2 * x + ( y – 2 ) * 5.
        System.out.println("4. Найдите  значение функции: z = ( (a – 3 ) * b / 2) + c.");
        double z, a, b, c;
        a=5;
        b=7;
        c=15;
        z = ( (a - 3 ) * b / 2.0) + c;
        System.out.println(z);
    }

    public static void Task5(){
        //5. Составить алгоритм нахождения среднего арифметического двух чисел
        System.out.println("5. Составить алгоритм нахождения среднего арифметического двух чисел ");
        int[] num = {10, 25};

        double average = 0;
        if (num.length > 0)
        {
            double sum = 0;
            for (int i = 0; i < num.length; i++) {
                sum += num[i];
            }
            average = sum / num.length;
        }
        System.out.println(average);
    }

    public static void Task6(){
        //6. Написать код для решения задачи. В n малых бидонах 80 л молока. Сколько литров молока в m больших бидонах, если в каждом большом бидоне на 12 л. больше, чем в малом?
        System.out.println("6. Написать код для решения задачи. В n малых бидонах 80 л молока. " +
                "Сколько литров молока в m больших бидонах, если в каждом большом бидоне на 12 л. больше, чем в малом?");
        int m=10; //большие бидоны
        int n=15; //малые бидоны
        int с; //литры

        с= (80/n +12)*m;

        System.out.println("Ответ: В "+m+" больших бидонах "+с +" литров молока, при условии, что малых бидонов "+ n);
    }

    public static void Task7(){
       // 7. Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника
        System.out.println("7. Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника ");
        int m=10;
        int n=m/2;
        int S = n*m;
        System.out.println("Ответ: "+S+" ед.2 площадь прямоугольника, у которго сторны равны "+m+" и "+n);
    }

    public static void Task8(){
        // 8. Вычислить значение выражения по формуле (все переменные принимают действительные значения):
        System.out.println("8. Вычислить значение выражения по формуле (все переменные принимают действительные значения): ");
        double a=10;
        double b=2;
        double c=15;
        double z;
        z=(b + sqrt(pow(b,2)+4*a*c))/(2*a)-pow(a,3)*c+pow(b, -2);
        System.out.println(z);
    }

    public static void Task9(){
        // 8. Вычислить значение выражения по формуле (все переменные принимают действительные значения):
        System.out.println("9. Вычислить значение выражения по формуле (все переменные принимают действительные значения): ");
        double a=10;
        double b=2;
        double c=15;
        double d=26;
        double z;
        z=(a/c)*(b/d)-((a*b/c)/(c*d));
        System.out.println(z);
    }
    public static void Task10(){
        // 8. Вычислить значение выражения по формуле (все переменные принимают действительные значения):
        System.out.println("10. Вычислить значение выражения по формуле (все переменные принимают действительные значения): ");
        double x=90*PI/180.0;
        double y=90*PI/180.0;

        double z;
        z=(sin(x)+cos(y))/(cos(x)-sin(y))*tan(x*y);
        System.out.println(z);
    }
    public static void Task11(){
        // 11. Вычислить периметр и площадь прямоугольного треугольника по длинам а и b  двух катетов.
        System.out.println("11. Вычислить периметр и площадь прямоугольного треугольника по длинам а и b  двух катетов.  ");
        double a=10;
        double b=8;
        double z;
        z=(a*b)/2;
        System.out.println("Периметр и площадь прямоугольного треугольника " +z);
    }

    public static void Task12(){
        // 12. Вычислить расстояние между двумя точками с данными координатами (х1, у1)и (x2, у2).
        System.out.println("12. Вычислить расстояние между двумя точками с данными координатами (х1, у1) и (x2, у2).");
        double x1=10;
        double x2=18;
        double y1=4;
        double y2=15;
        double z;
        z=sqrt(pow(abs(x2-x1),2)+pow(abs(y2-y1),2));
        double z1=hypot(abs(x2-x1), abs(y2-y1));
        System.out.println("z= " +z +",z1= " +z1);
    }
    public static void Task13(){
        //  13. Заданы координаты трех вершин треугольника  (х1 у2),(х2, у2) ),(х3, у3). Найти его периметр и площадь.
        System.out.println("13. Заданы координаты трех вершин треугольника  (х1 у2),(х2, у2) ),(х3, у3). Найти его периметр и площадь.");
        double x1=10;
        double x2=18;
        double x3=26;
        double y2=15;
        double y3=65;
        double P;
        double S;
        //надем длину стороны ab c координатами (х1 у2),(х2, у2)
        double ab = abs(x2-x1);
        //надем длину стороны ac c координатами (х1 у2),(х3, у3)
        double ac=hypot(abs(x3-x1), abs(y3-y2));
        //надем длину стороны bc c координатами (х2 у2),(х3, у3)
        double bc=hypot(abs(x3-x2), abs(y3-y2));

        P= ab+ac+bc;
        double p =P/2; // полупериметр
        S= sqrt(p*(p-ab)*(p-bc)*(p-ac));

        System.out.println("Периметр треугольника P= " +P +", площодь треуголника S= " +S);
    }

    public static void Task14(){
        //  14. Вычислить длину окружности и площадь круга одного и того же заданного радиуса R.
        System.out.println("14. Вычислить длину окружности и площадь круга одного и того же заданного радиуса R.");
        double r=10;

        double P;
        double S;

        P = 2*PI*r;
        S =PI*r*r;
        System.out.println("Длина окружности P= " +P +", площодь круга S= " +S);
    }

    public static void Task15() {
        //  15. Написать программу, которая выводит на экран первые четыре степени числа π.
        System.out.println("15. Написать программу, которая выводит на экран первые четыре степени числа π.");
        for (int i = 1; i < 5; i++) {
            double P = pow(PI, i);
            System.out.println(" Пи в степени i= " + i + " равно P= " + P);
        }
    }

    public static void Task16(){
        //  16. Найти произведение цифр заданного четырехзначного числа.
        System.out.println("16. Найти произведение цифр заданного четырехзначного числа. ");
       int num= 1564;
       int n =0;
       // for(int i=0; i<4; i++)
        while(num > 0){
            n += num % 10;
            num=num/10;
        }
        System.out.println(" Сумма четырехзначного числа " +n);

    }
    public static void Task17(){
        //  117. Даны два числа. Найти среднее арифметическое кубов этих чисел и среднее геометрическое модулей этих чисел.
        System.out.println("17. Даны два числа. Найти среднее арифметическое кубов этих чисел и среднее геометрическое модулей этих чисел. ");
        double[] num= {8, 4};
        double SA=0;
        double sum=0;
        double p =1.0; //произведение
        double GM =0;
        if(num.length>0){
            for (int i=0; i<num.length; i++){
                sum+=pow(num[i], 3);
                p*=abs(num[i]);
               }
              SA = sum/num.length;
            GM = pow(p, 1.0/num.length);
        }

        System.out.println("Cреднее арифметическое кубов " + SA+ " среднее геометрическое модулей этих чисел " + GM);

    }
    public static void Task18(){
        //  18. Дана длина ребра куба. Найти площадь грани, площадь полной поверхности и объем этого куба
        System.out.println("18. Дана длина ребра куба. Найти площадь грани, площадь полной поверхности и объем этого куба");
        double a =5.0; //произведение
        double SG = pow(a,2);
        double s = SG*6;
        double V = pow(a,3);
        System.out.println("площадь грани SG =" + SG+ " площадь полной поверхности s=" + s+ " объем этого куба V = "+V);
    }

    public static void Task19(){
        //  19. Дана сторона равностороннего треугольника. Найти площадь этого треугольника, его высоту, радиусы вписанной и описанной окружностей.
        System.out.println("19. Дана сторона равностороннего треугольника. Найти площадь этого треугольника, его высоту, радиусы вписанной и описанной окружностей. ");
        double a =5.0; //произведение

        double S = (sqrt(3)*pow(a,2))/4;
        double h = (sqrt(3)*a)/4;
        double r= a/(2*sqrt(3));
        double R = a/sqrt(3);
        System.out.println("площадь равностороннего треугольника S =" + S+ " высота h=" + h+ " радиус вписанной окружности r = "+r + " радиус вписанной окружности R = "+R);
    }

    public static void Task20(){
        // 20. Известна длина окружности. Найти площадь круга, ограниченного этой окружностью.
        System.out.println("20. Известна длина окружности. Найти площадь круга, ограниченного этой окружностью.");
        double C =5.0; //произведение

        double S = PI*pow((C/(2*PI)),2);

        System.out.println("площадь круга S =" + S);
    }

    public static void Task21(){
        // 21. Дано действительное число R вида nnn.ddd (три цифровых разряда в дробной и целой частях). Поменять местами дробную и целую части числа и вывести полученное значение числа.
        System.out.println("21. Дано действительное число R вида nnn.ddd ( 354.211 три цифровых разряда в дробной и целой частях). Поменять местами дробную и целую части числа и вывести полученное значение числа.");
        double C =354.211; //произведение

        double s =(double) ((int)C - (int)C/1000)/1000;
        int d = (int)((C - ((int)C - (int)C/1000))*1000);
        double res = d+s;

        System.out.println("число со смененеными частями  S =" + res);
    }

    public static void Task22(){
        // 22. Дано натуральное число Т, которое представляет длительность прошедшего времени в секундах. Вывести данное значение длительности в часах, минутах и секундах в следующей форме: ННч ММмин SSc.
        System.out.println("22. Дано натуральное число Т, которое представляет длительность прошедшего времени в секундах. Вывести данное значение длительности в часах, минутах и секундах в следующей форме: ННч ММмин SSc.");

        long t  = 1522678085L;

        SimpleDateFormat sdfDate = new SimpleDateFormat("HHч mmм ssс");
        Date last = new Date(t);
        Date curent = new Date();
        String lastDate = sdfDate.format(last);
        String curentDate = sdfDate.format(curent);

        System.out.println("Ответ: значение длительности в часах, минутах и секундах в следующей форме: ННч ММмин SSc. lastDate = "+ lastDate+" curentDate= "+curentDate);
    }

    public static void Task23(){
        // 23. Найти площадь кольца, внутренний радиус которого равен r, а внешний — R (R> r).
        System.out.println("23. Найти площадь кольца, внутренний радиус которого равен r, а внешний — R (R> r). ");

        double r  = 5.0;
        double R  = 6.0;
        double s_ring = PI*pow(R,2) - PI*pow(r,2);

        System.out.println("Ответ: площадь кольца s_ring = "+ s_ring);
    }

    public static void Task24(){
        // 24. Найти площадь равнобедренной трапеции с основаниями а и  b  и углом α при большем основании а.
        System.out.println("24. Найти площадь равнобедренной трапеции с основаниями а и  b  и углом α при большем основании а. ");
        double a  = 6.0; // большое основание трапеции
        double b  = 5.0; //маллое основание трапеции
        double c; //малый катет треугольника
        double alpha = 45; //углом α (в градусах )при большем основании а
        c=(a-b)/2;
        double h = c *tan(alpha*PI/180.0);
        double tan = tan(alpha*PI/180.0);
        double s_trap=((a + b)/2)*h;

        System.out.println("Ответ: площадь равнобедренной трапеции s_trap = " + s_trap + "tan= " + tan);
    }

    public static void Task25(){
        // 25. Вычислить корни квадратного уравнения ах2+ bх + с = 0 с заданными коэффициентами a, b и с (предполагается, что а≠0 и что дискриминант уравнения неотрицателен).
        System.out.println("25. Вычислить корни квадратного уравнения ах2+ bх + с = 0 с заданными коэффициентами a, b и с (предполагается, что а≠0 и что дискриминант уравнения неотрицателен).");
      double a, b, c;
      double x1, x2, d;
        a=2; b=25; c=6;
        x1=0; x2=0;
        d= b*b - 4*a*c;

        if (d>0){
        x1 = (-b + sqrt(d))/(2*a);
        x2 = (-b - sqrt(d))/(2*a);
        System.out.println("Ответ: квадратного уравнения x1 = " + x1 + " x2 = " + x2);
        }
        else if (d==0) System.out.println("Ответ: квадратное уравнение имеет один корень x=" + (-b/(2*a)));
        else System.out.println("Ответ: квадратное уравнение не имеет корней d= "+d);
    }

    public static void Task26(){
        // 26. Найти площадь треугольника, две стороны которого равны а и b, а угол между этими сторонами у.
        System.out.println("26. Найти площадь треугольника, две стороны которого равны а и b, а угол между этими сторонами у.");
        double a  = 6.0; // сторона треугольника
        double b  = 5.0; // сторона треугольника
        double alpha = 45; //углом α (в градусах ) между этими сторонами
        double s= a*b*sin(alpha*PI/180.0);
        System.out.println("Ответ: площадь треугольника s = " + s);
    }

    public static void Task27(){
        // 27. Дано значение a. Не используя никаких функций и никаких операций, кроме умножения, получить значение а8 за три операции и  а10 за четыре операции.
        System.out.println("27. Дано значение a. Не используя никаких функций и никаких операций, кроме умножения, получить значение а8 за три операции и  а10 за четыре операции. ");
        int a  = 6; // сторона треугольника
        int a2 = a*a;
        int a8=a2*a2;
        a8=a8*a8;
        int a10=a8*a2;

        System.out.println("Ответ: a8 = " + a8 + " a10 = " + a10);
    }

    public static void Task28(){
        //28. Составить программу перевода радианной меры угла в градусы, минуты и секунды
        System.out.println("28. Составить программу перевода радианной меры угла в градусы, минуты и секунды");
        double rad  = 6.32; // радианная мера угла
        int grad = (int)(180.0/PI*rad);
        int m =(int)(((180.0/PI*rad)-grad)*60);
        int s = (int)round((((180.0/PI*rad)-grad)*60 - m)*60);
        System.out.println("Ответ: "+rad + " rad это grad = " + grad + " min = " + m + " sec = " +s);
    }

    public static void Task29(){
      //  29. Найти (в радианах в градусах) все углы треугольника со сторонами а, b, с.
        System.out.println("29. Найти (в радианах в градусах) все углы треугольника со сторонами а, b, с. ");
        double a, b, c; // стороны треугольника
        a=5; b=6; c=7;
        double alpha_rad = acos((c*c+b*b-a*a)/(2*b*c));
        double alpha_grad=(180.0/PI*alpha_rad);
        double beta_rad = acos((c*c+a*a-b*b)/(2*a*c));
        double beta_grad=(180.0/PI*beta_rad);
        double sigma_rad = acos((b*b+a*a-c*c)/(2*a*b));
        double sigma_grad=(180.0/PI*sigma_rad);

        System.out.println("Ответ: alpha_rad = "+alpha_rad +" alpha_grad= "+alpha_grad+" beta_rad = "+beta_rad +" beta_grad= "+beta_grad+" sigma_rad = "+sigma_rad +" sigma_grad= "+sigma_grad);
    }

    public static void Task30(){
        //  30. Три сопротивления R1 R2, и R3 соединены параллельно. Найдите сопротивление соединения.
        System.out.println("30. Три сопротивления R1 R2, и R3 соединены параллельно. Найдите сопротивление соединения.");
        double R1, R2, R3;
        R1=5; R2=6; R3=1;
        double Rr = (R1*R2*R3)/(R1*R2+R3*R2+R1*R3);
        System.out.println("Ответ: Rr= "+Rr );
    }

    public static void Task31(){
        //  31. Составить программу для вычисления пути, пройденного лодкой, если ее скорость в стоячей воде v км/ч, скорость течения реки v1 км/ч, время движения по озеру t1 ч, а против течения реки — t2 ч.
        System.out.println("31. Составить программу для вычисления пути, пройденного лодкой, если ее скорость в стоячей воде v км/ч, скорость течения реки v1 км/ч, время движения по озеру t1 ч, а против течения реки — t2 ч. ");
        int v, v1, t1, t2; //
        v=10; v1=2; t1=1; t2 =10;
        int s = (v*t1)+(v-v1)*t2;
        System.out.println("Ответ: путь, пройденный лодкой= "+s +"км" );
    }

    public static void Task32(){
        //  32. Текущее показание электронных часов: т ч (0 ≤ т ≤23) п мин (0 ≤ п ≤59) к с (0 ≤к ≤59). Какое время будут показывать часы через р ч q мин r с?
        System.out.println("32. Текущее показание электронных часов: т ч (0 ≤ т ≤23) п мин (0 ≤ п ≤59) к с (0 ≤к ≤59). Какое время будут показывать часы через р ч q мин r с?");
        int v, v1, t1, t2; //
        v=10; v1=2; t1=1; t2 =10;
        int s = (v*t1)+(v-v1)*t2;
        System.out.println("Ответ: путь, пройденный лодкой= "+s +"км" );
    }

    public static void Task33(){
        //  33. Ввести любой символ и определить его порядковый номер, а также указать предыдущий и последующий символы
        System.out.println("33. Ввести любой символ и определить его порядковый номер, а также указать предыдущий и последующий символы");

        System.out.println("Ответ: " );
    }

    public static void Task34(){
        //  Дана величина А, выражающая объем информации в байтах. Перевести А в более крупные единицы измерения информации.
        System.out.println("34. Дана величина А, выражающая объем информации в байтах. Перевести А в более крупные единицы измерения информации. ");
        double А = 230000000; //байт
        double B = А/1024; // Kбайты
        double C = B/1024; // Mбайты
        double D = C/1024; // Гбайты
        double E = D/1024; // Тбайты

        System.out.println("Ответ: A=" + E +" Тбайт" );
    }

    public static void Task35(){
        //  Дана величина А, выражающая объем информации в байтах. Перевести А в более крупные единицы измерения информации.
        System.out.println("35. Даны натуральные числа М и N. Вывести старшую цифру дробной части и младшую цифру целой части числа M/N.");
        double M, N, C;
        M=2315; N=12;
        C=M/N;
        double s_drob =C-(int)C;

        System.out.println("Ответ: старшая цифра дробной = "+(int)(s_drob*10) +" младшую цифру целой части = "+ (int)C%10 );
    }

    public static void Task36(){
       //36. Найти частное произведений четных и нечетных цифр четырехзначного числа.
        System.out.println("36. Найти частное произведений четных и нечетных цифр четырехзначного числа.");
       int n= 1546;
       int i;
       int even=1, odd=1;
         while (n%10 != 0){
             i=n%10;
             n=n/10;

             if (i%2==0){
                 even=even*i;
             }
             else odd=odd*i;
         }
         double d = (double) even/odd;

        System.out.println("Ответ: произведений четных = "+ even +" нечетных = "+ odd + " частное произведений четных и нечетных цифр = " +d);
    }

    public static void Task37(){
        /*
        37. Составить линейную программу, печатающую значение true, если указанное высказывание является истинным, и false — в противном случае:
        • Целое число N является четным двузначным числом.
        • Сумма двух первых цифр заданного четырехзначного числа равна сумме двух его последних цифр.
        • Сумма цифр данного трехзначного числа N является четным числом.
        • Точка с координатами (х, у) принадлежит части плоскости, лежащей между прямыми х= т, х= п (т<п).
        • Квадрат заданного трехзначного числа равен кубу суммы цифр этого числа.
        • Треугольник со сторонами а,b,с является равнобедренным.
        • Сумма каких-либо двух цифр заданного трехзначного натурального числа N равна третьей цифре.
        • Заданное число N является степенью числа а (показатель степени может находиться в диапазоне от 0 до 4).
        • График функции у = ах2 + bх+ с проходит через заданную точку с координатами (m, п).*/

        System.out.println(" 37. Составить линейную программу, печатающую значение true, если указанное высказывание является истинным, и false");
        int n=39;
        int s=n;
        int i=0;
        int k;
        int sum=0;
        while (n%10!=0){
            k=n%10;
            i++;
            n=n/10;
            sum =sum+k;
        }
       if (i==2 && s%2==0) System.out.println("true");
       else if(i==3 && (sum%2==0))System.out.println("true "+sum );
       else System.out.println("Ответ: false" );
    }

    public static void Task37b() {
        /*
        37b. Составить линейную программу, печатающую значение true, если указанное высказывание является истинным, и false — в противном случае:
         • Сумма двух первых цифр заданного четырехзначного числа равна сумме двух его последних цифр.
       */
        System.out.println("37b. Составить линейную программу, печатающую значение true, если указанное высказывание является истинным, и false — в противном случае:\n" +
                "• Сумма двух первых цифр заданного четырехзначного числа равна сумме двух его последних цифр.");

        int n = 1421;
        int a = n % 100;
        int b= (int)n/100;
        int k;
        int sum_a=0, sum_b=0;
        while (a%10!=0){
            k=a%10;
            a=a/10;
            sum_a =sum_a+k;
        }
        while (b%10!=0){
            k=b%10;
            b=b/10;
            sum_b =sum_b+k;
        }
        if(sum_a==sum_b) System.out.println("true");
        else System.out.println("Ответ: false" );
    }




    public static void Task38(){
        // 38. Для данных областей составить линейную программу, которая печатает true, если точка с координатами (х, у) принадлежит закрашенной области, и false — в противном случае:
        System.out.println("38. Для данных областей составить линейную программу, которая печатает true, если точка с координатами (х, у) принадлежит закрашенной области, и false — в противном случае: ");
        Task38_subtask_b();
    }

    private static void Task38_subtask_a() {
        int a, b, c, d; // первый прямоугольник
        int e, f, g;// второй прямоугольник
        int x, y;
        a=-4; b=4; c=0; d=-3;
        e=-2; f=2; g=4;
        x=-4; y=0;

        if (x>=a && x<=b && y>=d && y<=c) System.out.println("true");
        else if (x>=e && x<=f && y>=c && y<=g) System.out.println("true");
        else System.out.println("false");
    }

    private static void Task38_subtask_b() {
        int a, b, c, d; // первый прямоугольник
        int e, f, g;// второй прямоугольник
        int x, y;
        a=-4; b=4; c=0; d=-3;
        e=-2; f=2; g=4;
        x=-4; y=0;

        if (x>=a && x<=b && y>=d && y<=c) System.out.println("true");
        else if (x>=e && x<=f && y>=c && y<=g) System.out.println("true");
        else System.out.println("false");
    }

    private static void Task38_subtask_c() {
        int a, b, c, d; // первый прямоугольник
        int e, f, g;// второй прямоугольник
        int x, y;
        a=-4; b=4; c=0; d=-3;
        e=-2; f=2; g=4;
        x=-4; y=0;

        if (x>=a && x<=b && y>=d && y<=c) System.out.println("true");
        else if (x>=e && x<=f && y>=c && y<=g) System.out.println("true");
        else System.out.println("false");
    }



}
